## Plan Result (transactional-emails-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/197027)



<pre><code>Plan: 0 to add, 17 to change, 0 to destroy.</code></pre>

* Update
  * aws_cloudwatch_log_group.events_sqs-event-consumer_lambda_log-group_BD35528B
  * aws_cloudwatch_metric_alarm.events_sqs-event-consumer_errors_D9533157
  * aws_codedeploy_app.events_sqs-event-consumer_lambda-code-deploy_code-deploy-app_7EC26991
  * aws_codedeploy_deployment_group.events_sqs-event-consumer_lambda-code-deploy_code-deployment-group_BF92F57F
  * aws_iam_policy.events_sqs-event-consumer_lambda_execution-policy_1AD3460D
  * aws_iam_policy.events_sqs-event-consumer_sqs-policy_137E47FC
  * aws_iam_role.events_sqs-event-consumer_lambda-code-deploy_code-deploy-role_4FCF08D9
  * aws_iam_role.events_sqs-event-consumer_lambda_execution-role_F06C65D9
  * aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8
  * aws_s3_bucket.events_sqs-event-consumer_lambda_code-bucket_BDF9A5D8
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sqs_queue.events_sqs-event-consumer_lambda_sqs_queue_374A86EB
  * aws_sqs_queue.events_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_E7883864
  * aws_sqs_queue.sns-topic-dlq
  * aws_sqs_queue_policy.transactional-email-sns-dlq-policy
  * aws_sqs_queue_policy.transactional-email-sns-sqs-policy



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.events_sqs-event-consumer_lambda_sqs_policy_5106A819 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "events_sqs-event-consumer_lambda_sqs_policy_5106A819" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue",
            ]
        }
    }

  # data.aws_iam_policy_document.transactional-email-sns-dlq-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "transactional-email-sns-dlq-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ",
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.transactional-email-sns-sqs-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "transactional-email-sns-sqs-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue",
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_log_group.events_sqs-event-consumer_lambda_log-group_BD35528B will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "events_sqs-event-consumer_lambda_log-group_BD35528B" {
        id                = "/aws/lambda/TransactionalEmails-Prod-Sqs-Event-Consumer-Function"
        name              = "/aws/lambda/TransactionalEmails-Prod-Sqs-Event-Consumer-Function"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "TransactionalEmails"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.events_sqs-event-consumer_errors_D9533157 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "events_sqs-event-consumer_errors_D9533157" {
        id                                    = "TransactionalEmails-Prod-Sqs-Event-Consumer-Lambda-Errors-Alarm"
      ~ tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "TransactionalEmails"
        }
      ~ tags_all                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)
    }

  # aws_codedeploy_app.events_sqs-event-consumer_lambda-code-deploy_code-deploy-app_7EC26991 will be updated in-place
  ~ resource "aws_codedeploy_app" "events_sqs-event-consumer_lambda-code-deploy_code-deploy-app_7EC26991" {
        id                  = "aa972051-f1ba-4d04-ae8a-b585123cb1a4:TransactionalEmails-Prod-Sqs-Event-Consumer-Lambda"
        name                = "TransactionalEmails-Prod-Sqs-Event-Consumer-Lambda"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_deployment_group.events_sqs-event-consumer_lambda-code-deploy_code-deployment-group_BF92F57F will be updated in-place
  ~ resource "aws_codedeploy_deployment_group" "events_sqs-event-consumer_lambda-code-deploy_code-deployment-group_BF92F57F" {
        id                          = "977bbab8-79dc-406c-8dc2-8ef9fffa78b9"
        tags                        = {}
      ~ tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.events_sqs-event-consumer_lambda_execution-policy_1AD3460D will be updated in-place
  ~ resource "aws_iam_policy" "events_sqs-event-consumer_lambda_execution-policy_1AD3460D" {
        id               = "arn:aws:iam::996905175585:policy/TransactionalEmails-Prod-Sqs-Event-Consumer-ExecutionRolePolicy"
        name             = "TransactionalEmails-Prod-Sqs-Event-Consumer-ExecutionRolePolicy"
      ~ tags             = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "TransactionalEmails"
        }
      ~ tags_all         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.events_sqs-event-consumer_sqs-policy_137E47FC will be updated in-place
  ~ resource "aws_iam_policy" "events_sqs-event-consumer_sqs-policy_137E47FC" {
        id               = "arn:aws:iam::996905175585:policy/TransactionalEmails-Prod-Sqs-Event-Consumer-LambdaSQSPolicy"
        name             = "TransactionalEmails-Prod-Sqs-Event-Consumer-LambdaSQSPolicy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "TransactionalEmails"
        }
      ~ tags_all         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_role.events_sqs-event-consumer_lambda-code-deploy_code-deploy-role_4FCF08D9 will be updated in-place
  ~ resource "aws_iam_role" "events_sqs-event-consumer_lambda-code-deploy_code-deploy-role_4FCF08D9" {
        id                    = "TransactionalEmails-Prod-Sqs-Event-Consumer-CodeDeployRole"
        name                  = "TransactionalEmails-Prod-Sqs-Event-Consumer-CodeDeployRole"
        tags                  = {}
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.events_sqs-event-consumer_lambda_execution-role_F06C65D9 will be updated in-place
  ~ resource "aws_iam_role" "events_sqs-event-consumer_lambda_execution-role_F06C65D9" {
        id                    = "TransactionalEmails-Prod-Sqs-Event-Consumer-ExecutionRole"
        name                  = "TransactionalEmails-Prod-Sqs-Event-Consumer-ExecutionRole"
      ~ tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "TransactionalEmails"
        }
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8 will be updated in-place
  ~ resource "aws_lambda_function" "events_sqs-event-consumer_lambda_3BE960B8" {
        id                             = "TransactionalEmails-Prod-Sqs-Event-Consumer-Function"
      ~ tags                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "TransactionalEmails"
        }
      ~ tags_all                       = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket.events_sqs-event-consumer_lambda_code-bucket_BDF9A5D8 will be updated in-place
  ~ resource "aws_s3_bucket" "events_sqs-event-consumer_lambda_code-bucket_BDF9A5D8" {
        id                          = "pocket-transactionalemails-prod-sqs-event-consumer"
      ~ tags                        = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "TransactionalEmails"
        }
      ~ tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_sns_topic.pagerduty_alarm-critical-topic_F1534579 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:TransactionalEmails-Prod-Infrastructure-Alarm-Critical"
        name                                     = "TransactionalEmails-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
      ~ tags_all                                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:TransactionalEmails-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "TransactionalEmails-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
      ~ tags_all                                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sqs_queue.events_sqs-event-consumer_lambda_sqs_queue_374A86EB will be updated in-place
  ~ resource "aws_sqs_queue" "events_sqs-event-consumer_lambda_sqs_queue_374A86EB" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
        name                              = "TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "TransactionalEmails"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.events_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_E7883864 will be updated in-place
  ~ resource "aws_sqs_queue" "events_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_E7883864" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-Sqs-Event-Consumer-Queue-Deadletter"
        name                              = "TransactionalEmails-Prod-Sqs-Event-Consumer-Queue-Deadletter"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "TransactionalEmails"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.sns-topic-dlq will be updated in-place
  ~ resource "aws_sqs_queue" "sns-topic-dlq" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-SNS-Topics-DLQ"
        name                              = "TransactionalEmails-Prod-SNS-Topics-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "TransactionalEmails"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-transactionalemails"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.transactional-email-sns-dlq-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "transactional-email-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-SNS-Topics-DLQ"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnLike = {
                              - "aws:SourceArn" = [
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.transactional-email-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "transactional-email-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnLike = {
                              - "aws:SourceArn" = [
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 17 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"3605c40b-d643-4f8b-b25a-105ad79f03e5","JobName":"transactional-emails_infrastructure_plan_prod","PRNumber":572,"Program":"tfcmt","SHA1":"8cce0ef636735b4f73d5efb2fde7796641120371","Target":"transactional-emails-cdk","Vars":{}} -->